#### BuiltInFailures.HostObjFailures Members

---

|  |
| --- |
| BuiltInFailures HostObjFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures HostObjFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | HostMismatch | Can't use this type in this host. |
| Public property Static member | ReferencesNulled | One or more references are or have become invalid. |

# See Also

BuiltInFailures HostObjFailures Class

Autodesk.Revit.DB Namespace